environment/environment_setup.org
#+title: Environment Setup

氏名: 上村 知

研究室: 巳波研究室 (M1)

学籍番号: 47024711


* Installations

For all 'sudo apt install' -> use 'homebrew install' (bc prof uses windows)

** List of things to install
  - emacs
  - ruby
  - myhelp

* Emacs Usage
  - -nw -> creates new file

* Ruby programs
  - End with .rb

* Getting files from Github
  - git clone *link*
  - Get link from github site of file -> use SSH version

* Terminal Usage

Prof's directions -> for windows

** For Mac
  - Split screen -> Cmd + D
  - Exit split screen -> Cmd + Shift + D
  - for emacs: when in doubt-> ctrl x + ctrl c (exits emacs entirely, but confirms save beforehand)
  
** My _ help Usage
  - Purpose: Store information on how certain softwares (ex.: emacs) are used.
  - -l (or list): shows a list of instruction files that are stored
  - help: shows list of commands that can be used
  - edit [PAGE]: edit instruction file in emacs