environment/environment_setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-12 Tue 18:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Environment Setup</title>
<meta name="author" content="Sato Kamimura" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Environment Setup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org836445a">1. Installations</a>
<ul>
<li><a href="#org7dac85f">1.1. List of things to install</a></li>
</ul>
</li>
<li><a href="#org9eb71d2">2. Emacs Usage</a></li>
<li><a href="#org1102d6b">3. Ruby programs</a></li>
<li><a href="#orge484047">4. Getting files from Github</a></li>
<li><a href="#orgbbe21ea">5. Terminal Usage</a>
<ul>
<li><a href="#org5d0c1af">5.1. For Mac</a></li>
<li><a href="#orgd2ce2a1">5.2. My _ help Usage</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
氏名: 上村 知
</p>

<p>
研究室: 巳波研究室 (M1)
</p>

<p>
学籍番号: 47024711
</p>


<div id="outline-container-org836445a" class="outline-2">
<h2 id="org836445a"><span class="section-number-2">1.</span> Installations</h2>
<div class="outline-text-2" id="text-1">
<p>
For all 'sudo apt install' -&gt; use 'homebrew install' (bc prof uses windows)
</p>
</div>

<div id="outline-container-org7dac85f" class="outline-3">
<h3 id="org7dac85f"><span class="section-number-3">1.1.</span> List of things to install</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>emacs</li>
<li>ruby</li>
<li>myhelp</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9eb71d2" class="outline-2">
<h2 id="org9eb71d2"><span class="section-number-2">2.</span> Emacs Usage</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>-nw -&gt; creates new file</li>
</ul>
</div>
</div>

<div id="outline-container-org1102d6b" class="outline-2">
<h2 id="org1102d6b"><span class="section-number-2">3.</span> Ruby programs</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>End with .rb</li>
</ul>
</div>
</div>

<div id="outline-container-orge484047" class="outline-2">
<h2 id="orge484047"><span class="section-number-2">4.</span> Getting files from Github</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>git clone <b>link</b></li>
<li>Get link from github site of file -&gt; use SSH version</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbe21ea" class="outline-2">
<h2 id="orgbbe21ea"><span class="section-number-2">5.</span> Terminal Usage</h2>
<div class="outline-text-2" id="text-5">
<p>
Prof's directions -&gt; for windows
</p>
</div>

<div id="outline-container-org5d0c1af" class="outline-3">
<h3 id="org5d0c1af"><span class="section-number-3">5.1.</span> For Mac</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Split screen -&gt; Cmd + D</li>
<li>Exit split screen -&gt; Cmd + Shift + D</li>
<li>for emacs: when in doubt-&gt; ctrl x + ctrl c (exits emacs entirely, but confirms save beforehand)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd2ce2a1" class="outline-3">
<h3 id="orgd2ce2a1"><span class="section-number-3">5.2.</span> My _ help Usage</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Purpose: Store information on how certain softwares (ex.: emacs) are used.</li>
<li>-l (or list): shows a list of instruction files that are stored</li>
<li>help: shows list of commands that can be used</li>
<li>edit [PAGE]: edit instruction file in emacs</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sato Kamimura</p>
<p class="date">Created: 2024-11-12 Tue 18:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
